tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
# Access Log Profiler
brew "alp"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Shell extension to jump to frequently used directories
brew "autojump"
# Programmable completion for Bash 3.2
brew "bash-completion"
# High performance key/value database
brew "berkeley-db"
# C library implementing the SSH2 protocol
brew "libssh2"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Utility to optimize JPEG files
brew "jpegoptim"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# Asynchronous event library
brew "libevent"
# General-purpose lossless data-compression library
brew "zlib"
# Text-based UI library
brew "ncurses"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Node.js version manager
brew "nodebrew"
# Open source suite of directory software
brew "openldap"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@14"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Vi 'workalike' with many additional features
brew "vim"
# Terraform
brew "hashicorp/tap/terraform"
# Virtual Audio Driver
cask "blackhole-2ch"
# Virtual monitor for screen sharing
cask "deskpad"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Desktop automation application
cask "hammerspoon"
